
<img style="float: left;;" src='Figures/alinco.png' height="100"/></a>

# <center> <font color= #000047> DataFrames en Pandas</font> </center>

# DataFrames

Los DataFrames son la principal herramienta de la librería de pandas y se inspiran directamente en el lenguaje de programación R. Podemos pensar en un DataFrame como un grupo de objetos Series juntos para compartir el mismo índice. ¡Usemos pandas para explorar este tema!

In [1]:
# Importar librerías
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0  1.342834 -0.204320  0.099326 -0.515648
1  0.521607 -1.421168 -2.242971 -0.678773
2 -1.378128  1.031990  0.116171  0.122788
3 -0.470539  2.099113  1.398264 -1.481516
4 -1.832190  0.982516  2.576350  0.371901

In [5]:
df[1]

0   -0.204320
1   -1.421168
2    1.031990
3    2.099113
4    0.982516
Name: 1, dtype: float64

In [6]:
ind = 'A B C D E'.split()
ind

['A', 'B', 'C', 'D', 'E']

In [7]:
df = pd.DataFrame(np.random.randn(5,4), index=ind, columns='W X Y Z'.split())
df

          W         X         Y         Z
A -0.276718  0.367020  2.188202 -0.877368
B  0.156900  1.351268  0.460851  0.020203
C -0.339771 -0.400362  0.424481 -0.227793
D  0.584019  0.728608 -0.224837  2.413936
E -0.404002 -1.052726  0.908341  0.256418

## Selección e Indexación

Aprendamos los diversos métodos para obtener datos de un DataFrame

In [8]:
df['W']

A   -0.276718
B    0.156900
C   -0.339771
D    0.584019
E   -0.404002
Name: W, dtype: float64

In [9]:
df.loc['C','X']

-0.40036217449626077

In [10]:
df.iloc[2,1]

-0.40036217449626077

In [11]:
df[['W','Z']]

          W         Z
A -0.276718 -0.877368
B  0.156900  0.020203
C -0.339771 -0.227793
D  0.584019  2.413936
E -0.404002  0.256418

In [12]:
df.W

A   -0.276718
B    0.156900
C   -0.339771
D    0.584019
E   -0.404002
Name: W, dtype: float64

In [14]:
df.loc['A',['W','Z']]

W   -0.276718
Z   -0.877368
Name: A, dtype: float64

### Creando una nueva columna:

In [19]:
df['new'] = (df['X'] - df['Y'])*2

In [18]:
df

          W         X         Y         Z       new
A -0.276718  0.367020  2.188202 -0.877368 -4.009384
B  0.156900  1.351268  0.460851  0.020203  0.429565
C -0.339771 -0.400362  0.424481 -0.227793 -1.249324
D  0.584019  0.728608 -0.224837  2.413936  1.178282
E -0.404002 -1.052726  0.908341  0.256418 -2.869408

### Eliminar Columnas

In [20]:
df.drop('new', axis=1)

          W         X         Y         Z
A -0.276718  0.367020  2.188202 -0.877368
B  0.156900  1.351268  0.460851  0.020203
C -0.339771 -0.400362  0.424481 -0.227793
D  0.584019  0.728608 -0.224837  2.413936
E -0.404002 -1.052726  0.908341  0.256418

In [21]:
df

          W         X         Y         Z       new
A -0.276718  0.367020  2.188202 -0.877368 -3.642364
B  0.156900  1.351268  0.460851  0.020203  1.780833
C -0.339771 -0.400362  0.424481 -0.227793 -1.649686
D  0.584019  0.728608 -0.224837  2.413936  1.906890
E -0.404002 -1.052726  0.908341  0.256418 -3.922134

In [22]:
df.drop('new', axis=1, inplace=True)

In [23]:
df

          W         X         Y         Z
A -0.276718  0.367020  2.188202 -0.877368
B  0.156900  1.351268  0.460851  0.020203
C -0.339771 -0.400362  0.424481 -0.227793
D  0.584019  0.728608 -0.224837  2.413936
E -0.404002 -1.052726  0.908341  0.256418

también podemos eliminar las columnas de esta forma:

### Seleccionar Columnas

df.loc[]
df.iloc

O seleccionar en base a la posición en vez de alguna etiqueta

### Seleccionar subconjunto de filas y columnas

In [25]:
df

          W         X         Y         Z
A -0.276718  0.367020  2.188202 -0.877368
B  0.156900  1.351268  0.460851  0.020203
C -0.339771 -0.400362  0.424481 -0.227793
D  0.584019  0.728608 -0.224837  2.413936
E -0.404002 -1.052726  0.908341  0.256418

In [24]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.367020  2.188202
B  1.351268  0.460851

In [26]:
df.iloc[[0,1],[1,2]]

          X         Y
A  0.367020  2.188202
B  1.351268  0.460851

In [28]:
df.iloc[:2, :2]

          W         X
A -0.276718  0.367020
B  0.156900  1.351268

### Selección condicional

Una característica importante de los pandas es la selección condicional mediante notación de corchetes, muy similar a numpy:

In [29]:
df

          W         X         Y         Z
A -0.276718  0.367020  2.188202 -0.877368
B  0.156900  1.351268  0.460851  0.020203
C -0.339771 -0.400362  0.424481 -0.227793
D  0.584019  0.728608 -0.224837  2.413936
E -0.404002 -1.052726  0.908341  0.256418

In [30]:
df>0

       W      X      Y      Z
A  False   True   True  False
B   True   True   True   True
C  False  False   True  False
D   True   True  False   True
E  False  False   True   True

In [31]:
df[df>0]

          W         X         Y         Z
A       NaN  0.367020  2.188202       NaN
B  0.156900  1.351268  0.460851  0.020203
C       NaN       NaN  0.424481       NaN
D  0.584019  0.728608       NaN  2.413936
E       NaN       NaN  0.908341  0.256418

In [32]:
df['W']>0

A    False
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [33]:
df[df['W']>0]

          W         X         Y         Z
B  0.156900  1.351268  0.460851  0.020203
D  0.584019  0.728608 -0.224837  2.413936

In [34]:
df[df['W']>0][['W','Z']]

          W         Z
B  0.156900  0.020203
D  0.584019  2.413936

In [36]:
df[(df['W']>0) & (df['Z']>0)]

          W         X         Y         Z
B  0.156900  1.351268  0.460851  0.020203
D  0.584019  0.728608 -0.224837  2.413936

## Más detalles del índice

Analicemos algunas características más de la indexación, incluido el restablecimiento del índice o resetearlo a otro valor. ¡También hablaremos sobre la jerarquía de índices!

In [37]:
df

          W         X         Y         Z
A -0.276718  0.367020  2.188202 -0.877368
B  0.156900  1.351268  0.460851  0.020203
C -0.339771 -0.400362  0.424481 -0.227793
D  0.584019  0.728608 -0.224837  2.413936
E -0.404002 -1.052726  0.908341  0.256418

In [38]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.276718  0.367020  2.188202 -0.877368
1     B  0.156900  1.351268  0.460851  0.020203
2     C -0.339771 -0.400362  0.424481 -0.227793
3     D  0.584019  0.728608 -0.224837  2.413936
4     E -0.404002 -1.052726  0.908341  0.256418

In [39]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [40]:
df['estados'] = newind

In [41]:
df

          W         X         Y         Z estados
A -0.276718  0.367020  2.188202 -0.877368      CA
B  0.156900  1.351268  0.460851  0.020203      NY
C -0.339771 -0.400362  0.424481 -0.227793      WY
D  0.584019  0.728608 -0.224837  2.413936      OR
E -0.404002 -1.052726  0.908341  0.256418      CO

In [42]:
df.set_index('estados', inplace=True)
df

                W         X         Y         Z
estados
CA      -0.276718  0.367020  2.188202 -0.877368
NY       0.156900  1.351268  0.460851  0.020203
WY      -0.339771 -0.400362  0.424481 -0.227793
OR       0.584019  0.728608 -0.224837  2.413936
CO      -0.404002 -1.052726  0.908341  0.256418

## DataFrame Resumen
Hay un par de formas de obtener datos resumidos en DataFrames.<br>
<tt><strong>df.describe()</strong></tt> proporciona estadísticas resumidas en todas las columnas numéricas.<br>
<tt><strong>df.info y df.dtypes</strong></tt> muestra el tipo de datos de todas las columnas.

In [43]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.055915  0.198762  0.751408  0.317079
std    0.419910  0.943728  0.899078  1.246216
min   -0.404002 -1.052726 -0.224837 -0.877368
25%   -0.339771 -0.400362  0.424481 -0.227793
50%   -0.276718  0.367020  0.460851  0.020203
75%    0.156900  0.728608  0.908341  0.256418
max    0.584019  1.351268  2.188202  2.413936

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [48]:
df['W'].dtype

dtype('float64')

# Datos Faltantes (Missing Data)

Mostraremos algunos métodos convenientes para lidiar con los datos faltantes en pandas:

In [49]:
df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [50]:
df.dropna() # axis=0

     A    B  C
0  1.0  5.0  1

In [51]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [52]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [53]:
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [54]:
df.fillna(value='unk')

     A    B  C
0  1.0  5.0  1
1  2.0  unk  2
2  unk  unk  3

# Groupby

El método groupby nos permite agrupar filas de datos y utilizar funciones de agregación

In [55]:
data = {'Company': ['GOOG','GOOG','MSFT', 'MSFT', 'FB', 'FB'],
       'Person': ['Sam','Charly','Amy', 'Vane', 'Carlos', 'Sara'],
       'Sales':[200,120,340,124,243,350]}

In [56]:
df = pd.DataFrame(data)
df

  Company  Person  Sales
0    GOOG     Sam    200
1    GOOG  Charly    120
2    MSFT     Amy    340
3    MSFT    Vane    124
4      FB  Carlos    243
5      FB    Sara    350

<strong>Ahora podemos utilizar el método .groupby () para agrupar filas en función del nombre de una columna. <br> Por ejemplo, agrupemos según la empresa. Esto creará un objeto DataFrameGroupBy:</strong>

In [58]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [60]:
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [61]:
df.groupby('Company')['Sales'].min()

Company
FB      243
GOOG    120
MSFT    124
Name: Sales, dtype: int64

In [62]:
df.groupby('Company')['Sales'].max()

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

In [63]:
df.groupby('Company')['Sales'].describe()

         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Operaciones

Hay muchas operaciones con pandas que serán realmente útiles para nosotros, por ejemplo:

In [64]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info de Valores Unicos

In [65]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [66]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [67]:
df['col2'].nunique()

3

In [68]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

### Seleccionando Datos

In [69]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

### Definiendo y aplicando funciones

In [70]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [73]:
def times2(x):
    return x**2 + 2*x +2

In [74]:
df['col1'].apply(times2)

0     5
1    10
2    17
3    26
Name: col1, dtype: int64

In [75]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [78]:
df['col4']=df['col1'].apply(times2)

In [79]:
df

   col1  col2 col3  col4
0     1     5  abc     5
1     2    10  def    10
2     3    17  ghi    17
3     4    26  xyz    26

In [80]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

### Eliminar una columna de forma permanente

In [81]:
del df['col4']

In [82]:
df

   col1  col2 col3
0     1     5  abc
1     2    10  def
2     3    17  ghi
3     4    26  xyz

### Obtener nombres de índice y columna:

In [83]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [84]:
df.set_index('col3', inplace=True)

In [85]:
df

      col1  col2
col3
abc      1     5
def      2    10
ghi      3    17
xyz      4    26

In [86]:
df.index

Index(['abc', 'def', 'ghi', 'xyz'], dtype='object', name='col3')

### Ordenar un DataFrame:

In [87]:
df

      col1  col2
col3
abc      1     5
def      2    10
ghi      3    17
xyz      4    26

In [88]:
df.sort_values(by='col2', inplace=True)

In [89]:
df

      col1  col2
col3
abc      1     5
def      2    10
ghi      3    17
xyz      4    26

In [90]:
help(df.sort_values)

Help on method sort_values in module pandas.core.frame:

sort_values(by: 'IndexLabel', *, axis: 'Axis' = 0, ascending: 'bool | list[bool] | tuple[bool, ...]' = True, inplace: 'bool' = False, kind: 'SortKind' = 'quicksort', na_position: 'str' = 'last', ignore_index: 'bool' = False, key: 'ValueKeyFunc | None' = None) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Sort by the values along either axis.

    Parameters
    ----------
    by : str or list of str
        Name or list of names to sort by.

        - if `axis` is 0 or `'index'` then `by` may contain index
          levels and/or column labels.
        - if `axis` is 1 or `'columns'` then `by` may contain column
          levels and/or index labels.
    axis : "{0 or 'index', 1 or 'columns'}", default 0
         Axis to be sorted.
    ascending : bool or list of bool, default True
         Sort ascending vs. descending. Specify list for multiple sort
         orders.  If this is a list of bools, must match the length of
         the by.
    inplace : bool, default False
         If True, perform operation in-place.
    kind : {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'
         Choice of sorting algorithm. See also :func:`numpy.sort` for more
         information. `mergesort` and `stable` are the only stable algorithms. For
         DataFrames, this option is only applied when sorting on a single
         column or label.
    na_position : {'first', 'last'}, default 'last'
         Puts NaNs at the beginning if `first`; `last` puts NaNs at the
         end.
    ignore_index : bool, default False
         If True, the resulting axis will be labeled 0, 1, …, n - 1.
    key : callable, optional
        Apply the key function to the values
        before sorting. This is similar to the `key` argument in the
        builtin :meth:`sorted` function, with the notable difference that
        this `key` function should be *vectorized*. It should expect a
        ``Series`` and return a Series with the same shape as the input.
        It will be applied to each column in `by` independently.

    Returns
    -------
    DataFrame or None
        DataFrame with sorted values or None if ``inplace=True``.

    See Also
    --------
    DataFrame.sort_index : Sort a DataFrame by the index.
    Series.sort_values : Similar method for a Series.

    Examples
    --------
    >>> df = pd.DataFrame({
    ...     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    ...     'col2': [2, 1, 9, 8, 7, 4],
    ...     'col3': [0, 1, 9, 4, 2, 3],
    ...     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
    ... })
    >>> df
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Sort by col1

    >>> df.sort_values(by=['col1'])
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort by multiple columns

    >>> df.sort_values(by=['col1', 'col2'])
      col1  col2  col3 col4
    1    A     1     1    B
    0    A     2     0    a
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort Descending

    >>> df.sort_values(by='col1', ascending=False)
      col1  col2  col3 col4
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B
    3  NaN     8     4    D

    Putting NAs first

    >>> df.sort_values(by='col1', ascending=False, na_position='first')
      col1  col2  col3 col4
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B

    Sorting with a key function

    >>> df.sort_values(by='col4', key=lambda col: col.str.lower())
       col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Natural sort with the key argument,
    using the `natsort <https://github.com/SethMMorton/natsort>` package.

    >>> df = pd.DataFrame({
    ...    "time": ['0hr', '128hr', '72hr', '48hr', '96hr'],
    ...    "value": [10, 20, 30, 40, 50]
    ... })
    >>> df
        time  value
    0    0hr     10
    1  128hr     20
    2   72hr     30
    3   48hr     40
    4   96hr     50
    >>> from natsort import index_natsorted
    >>> df.sort_values(
    ...     by="time",
    ...     key=lambda x: np.argsort(index_natsorted(df["time"]))
    ... )
        time  value
    0    0hr     10
    3   48hr     40
    2   72hr     30
    4   96hr     50
    1  128hr     20

In [91]:
df.sort_values(by='col2', inplace=True, ascending=False)

In [92]:
df

      col1  col2
col3
xyz      4    26
ghi      3    17
def      2    10
abc      1     5

# Entrada y salida de datos

La librería de pandas permite leer una variedad de tipos de archivos usando sus métodos pd.read_. Echemos un vistazo a los tipos de datos más comunes:

In [96]:
df_bank = pd.read_csv('Data/bank.csv')
df_bank.tail(10)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4511,46,blue-collar,married,secondary,no,668,yes,no,unknown,15,may,1263,2,-1,0,unknown,yes
4512,40,blue-collar,married,secondary,no,1100,yes,no,unknown,29,may,660,2,-1,0,unknown,no
4513,49,blue-collar,married,secondary,no,322,no,no,cellular,14,aug,356,2,-1,0,unknown,no
4514,38,blue-collar,married,secondary,no,1205,yes,no,cellular,20,apr,45,4,153,1,failure,no
4515,32,services,single,secondary,no,473,yes,no,cellular,7,jul,624,5,-1,0,unknown,no
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [97]:
df_bank.describe()

,age,balance,day,duration,campaign,pdays,previous
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,1422.657819,15.915284,263.961292,2.793630,39.766645,0.542579
std,10.576211,3009.638142,8.247667,259.856633,3.109807,100.121124,1.693562
min,19.000000,-3313.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,69.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,444.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,1480.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,71188.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

In [98]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4521 non-null   object
 2   marital    4521 non-null   object
 3   education  4521 non-null   object
 4   default    4521 non-null   object
 5   balance    4521 non-null   int64
 6   housing    4521 non-null   object
 7   loan       4521 non-null   object
 8   contact    4521 non-null   object
 9   day        4521 non-null   int64
 10  month      4521 non-null   object
 11  duration   4521 non-null   int64
 12  campaign   4521 non-null   int64
 13  pdays      4521 non-null   int64
 14  previous   4521 non-null   int64
 15  poutcome   4521 non-null   object
 16  y          4521 non-null   object
dtypes: int64(7), object(10)
memory usage: 600.6+ KB

## CSV
Los archivos de valores separados por comas (CSV), son archivos de texto que utilizan comas como delimitadores de campo.<br>
### CSV entrada

In [ ]:
#pd.read_csv

### CSV salida

In [99]:
df

      col1  col2
col3
xyz      4    26
ghi      3    17
def      2    10
abc      1     5

In [100]:
df.to_csv('Data/e1.csv')

## Excel
con Pandas podemos leer y escribir archivos de MS Excel. Sin embargo, esto solo importa datos, no fórmulas ni imágenes. Un archivo que contiene imágenes o macros puede causar que el método <tt>.read_excel()</tt> no funcione.

In [101]:
pd.read_excel('Data/Excel2.xlsx')

   Unnamed: 0   b   c   d
0           0   1   2   3
1           1   5   6   7
2           2   9  10  11
3           3  13  14  15

In [102]:
help(pd.read_excel)

Help on function read_excel in module pandas.io.excel._base:

read_excel(io, sheet_name: 'str | int | list[IntStrT] | None' = 0, *, header: 'int | Sequence[int] | None' = 0, names: 'SequenceNotStr[Hashable] | range | None' = None, index_col: 'int | str | Sequence[int] | None' = None, usecols: 'int | str | Sequence[int] | Sequence[str] | Callable[[str], bool] | None' = None, dtype: 'DtypeArg | None' = None, engine: "Literal['xlrd', 'openpyxl', 'odf', 'pyxlsb', 'calamine'] | None" = None, converters: 'dict[str, Callable] | dict[int, Callable] | None' = None, true_values: 'Iterable[Hashable] | None' = None, false_values: 'Iterable[Hashable] | None' = None, skiprows: 'Sequence[int] | int | Callable[[int], object] | None' = None, nrows: 'int | None' = None, na_values=None, keep_default_na: 'bool' = True, na_filter: 'bool' = True, verbose: 'bool' = False, parse_dates: 'list | dict | bool' = False, date_parser: 'Callable | lib.NoDefault' = <no_default>, date_format: 'dict[Hashable, str] | str | None' = None, thousands: 'str | None' = None, decimal: 'str' = '.', comment: 'str | None' = None, skipfooter: 'int' = 0, storage_options: 'StorageOptions | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>, engine_kwargs: 'dict | None' = None) -> 'DataFrame | dict[IntStrT, DataFrame]'
    Read an Excel file into a ``pandas`` ``DataFrame``.

    Supports `xls`, `xlsx`, `xlsm`, `xlsb`, `odf`, `ods` and `odt` file extensions
    read from a local filesystem or URL. Supports an option to read
    a single sheet or a list of sheets.

    Parameters
    ----------
    io : str, bytes, ExcelFile, xlrd.Book, path object, or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, and file. For file URLs, a host is
        expected. A local file could be: ``file://localhost/path/to/table.xlsx``.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method,
        such as a file handle (e.g. via builtin ``open`` function)
        or ``StringIO``.

        .. deprecated:: 2.1.0
            Passing byte strings is deprecated. To read from a
            byte string, wrap it in a ``BytesIO`` object.
    sheet_name : str, int, list, or None, default 0
        Strings are used for sheet names. Integers are used in zero-indexed
        sheet positions (chart sheets do not count as a sheet position).
        Lists of strings/integers are used to request multiple sheets.
        Specify ``None`` to get all worksheets.

        Available cases:

        * Defaults to ``0``: 1st sheet as a `DataFrame`
        * ``1``: 2nd sheet as a `DataFrame`
        * ``"Sheet1"``: Load sheet with name "Sheet1"
        * ``[0, 1, "Sheet5"]``: Load first, second and sheet named "Sheet5"
          as a dict of `DataFrame`
        * ``None``: All worksheets.

    header : int, list of int, default 0
        Row (0-indexed) to use for the column labels of the parsed
        DataFrame. If a list of integers is passed those row positions will
        be combined into a ``MultiIndex``. Use None if there is no header.
    names : array-like, default None
        List of column names to use. If file contains no header row,
        then you should explicitly pass header=None.
    index_col : int, str, list of int, default None
        Column (0-indexed) to use as the row labels of the DataFrame.
        Pass None if there is no such column.  If a list is passed,
        those columns will be combined into a ``MultiIndex``.  If a
        subset of data is selected with ``usecols``, index_col
        is based on the subset.

        Missing values will be forward filled to allow roundtripping with
        ``to_excel`` for ``merged_cells=True``. To avoid forward filling the
        missing values use ``set_index`` after reading the data instead of
        ``index_col``.
    usecols : str, list-like, or callable, default None
        * If None, then parse all columns.
        * If str, then indicates comma separated list of Excel column letters
          and column ranges (e.g. "A:E" or "A,C,E:F"). Ranges are inclusive of
          both sides.
        * If list of int, then indicates list of column numbers to be parsed
          (0-indexed).
        * If list of string, then indicates list of column names to be parsed.
        * If callable, then evaluate each column name against it and parse the
          column if the callable returns ``True``.

        Returns a subset of the columns according to behavior above.
    dtype : Type name or dict of column -> type, default None
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32}
        Use ``object`` to preserve data as stored in Excel and not interpret dtype,
        which will necessarily result in ``object`` dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
        If you use ``None``, it will infer the dtype of each column based on the data.
    engine : {'openpyxl', 'calamine', 'odf', 'pyxlsb', 'xlrd'}, default None
        If io is not a buffer or path, this must be set to identify io.
        Engine compatibility :

        - ``openpyxl`` supports newer Excel file formats.
        - ``calamine`` supports Excel (.xls, .xlsx, .xlsm, .xlsb)
          and OpenDocument (.ods) file formats.
        - ``odf`` supports OpenDocument file formats (.odf, .ods, .odt).
        - ``pyxlsb`` supports Binary Excel files.
        - ``xlrd`` supports old-style Excel files (.xls).

        When ``engine=None``, the following logic will be used to determine the engine:

        - If ``path_or_buffer`` is an OpenDocument format (.odf, .ods, .odt),
          then `odf <https://pypi.org/project/odfpy/>`_ will be used.
        - Otherwise if ``path_or_buffer`` is an xls format, ``xlrd`` will be used.
        - Otherwise if ``path_or_buffer`` is in xlsb format, ``pyxlsb`` will be used.
        - Otherwise ``openpyxl`` will be used.
    converters : dict, default None
        Dict of functions for converting values in certain columns. Keys can
        either be integers or column labels, values are functions that take one
        input argument, the Excel cell content, and return the transformed
        content.
    true_values : list, default None
        Values to consider as True.
    false_values : list, default None
        Values to consider as False.
    skiprows : list-like, int, or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int) at the
        start of the file. If callable, the callable function will be evaluated
        against the row indices, returning True if the row should be skipped and
        False otherwise. An example of a valid callable argument would be ``lambda
        x: x in [0, 2]``.
    nrows : int, default None
        Number of rows to parse.
    na_values : scalar, str, list-like, or dict, default None
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values. By default the following values are interpreted
        as NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'None',
        'n/a', 'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether ``na_values`` is passed in, the behavior is as follows:

        * If ``keep_default_na`` is True, and ``na_values`` are specified,
          ``na_values`` is appended to the default NaN values used for parsing.
        * If ``keep_default_na`` is True, and ``na_values`` are not specified, only
          the default NaN values are used for parsing.
        * If ``keep_default_na`` is False, and ``na_values`` are specified, only
          the NaN values specified ``na_values`` are used for parsing.
        * If ``keep_default_na`` is False, and ``na_values`` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the ``keep_default_na`` and
        ``na_values`` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing ``na_filter=False`` can improve the
        performance of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    parse_dates : bool, list-like, or dict, default False
        The behavior is as follows:

        * ``bool``. If True -> try parsing the index.
        * ``list`` of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * ``list`` of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * ``dict``, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index contains an unparsable date, the entire column or
        index will be returned unaltered as an object data type. If you don`t want to
        parse some cells as date just change their type in Excel to "Text".
        For non-standard datetime parsing, use ``pd.to_datetime`` after ``pd.read_excel``.

        Note: A fast-path exists for iso8601-formatted dates.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.

        .. deprecated:: 2.0.0
           Use ``date_format`` instead, or read in as ``object`` and then apply
           :func:`to_datetime` as-needed.
    date_format : str or dict of column -> format, default ``None``
       If used in conjunction with ``parse_dates``, will parse dates according to this
       format. For anything more complex,
       please read in as ``object`` and then apply :func:`to_datetime` as-needed.

       .. versionadded:: 2.0.0
    thousands : str, default None
        Thousands separator for parsing string columns to numeric.  Note that
        this parameter is only necessary for columns stored as TEXT in Excel,
        any numeric columns will automatically be parsed, regardless of display
        format.
    decimal : str, default '.'
        Character to recognize as decimal point for parsing string columns to numeric.
        Note that this parameter is only necessary for columns stored as TEXT in Excel,
        any numeric columns will automatically be parsed, regardless of display
        format.(e.g. use ',' for European data).

        .. versionadded:: 1.4.0

    comment : str, default None
        Comments out remainder of line. Pass a character or characters to this
        argument to indicate comments in the input file. Any data between the
        comment string and the end of the current line is ignored.
    skipfooter : int, default 0
        Rows at the end to skip (0-indexed).
    storage_options : dict, optional
        Extra options that make sense for a particular storage connection, e.g.
        host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
        are forwarded to ``urllib.request.Request`` as header options. For other
        URLs (e.g. starting with "s3://", and "gcs://") the key-value pairs are
        forwarded to ``fsspec.open``. Please see ``fsspec`` and ``urllib`` for more
        details, and for more examples on storage options refer `here
        <https://pandas.pydata.org/docs/user_guide/io.html?
        highlight=storage_options#reading-writing-remote-files>`_.

    dtype_backend : {'numpy_nullable', 'pyarrow'}, default 'numpy_nullable'
        Back-end data type applied to the resultant :class:`DataFrame`
        (still experimental). Behaviour is as follows:

        * ``"numpy_nullable"``: returns nullable-dtype-backed :class:`DataFrame`
          (default).
        * ``"pyarrow"``: returns pyarrow-backed nullable :class:`ArrowDtype`
          DataFrame.

        .. versionadded:: 2.0

    engine_kwargs : dict, optional
        Arbitrary keyword arguments passed to excel engine.

    Returns
    -------
    DataFrame or dict of DataFrames
        DataFrame from the passed in Excel file. See notes in sheet_name
        argument for more information on when a dict of DataFrames is returned.

    See Also
    --------
    DataFrame.to_excel : Write DataFrame to an Excel file.
    DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Notes
    -----
    For specific information on the methods used for each Excel engine, refer to the pandas
    :ref:`user guide <io.excel_reader>`

    Examples
    --------
    The file can be read using the file name as string or an open file object:

    >>> pd.read_excel('tmp.xlsx', index_col=0)  # doctest: +SKIP
           Name  Value
    0   string1      1
    1   string2      2
    2  #Comment      3

    >>> pd.read_excel(open('tmp.xlsx', 'rb'),
    ...               sheet_name='Sheet3')  # doctest: +SKIP
       Unnamed: 0      Name  Value
    0           0   string1      1
    1           1   string2      2
    2           2  #Comment      3

    Index and header can be specified via the `index_col` and `header` arguments

    >>> pd.read_excel('tmp.xlsx', index_col=None, header=None)  # doctest: +SKIP
         0         1      2
    0  NaN      Name  Value
    1  0.0   string1      1
    2  1.0   string2      2
    3  2.0  #Comment      3

    Column types are inferred but can be explicitly specified

    >>> pd.read_excel('tmp.xlsx', index_col=0,
    ...               dtype={'Name': str, 'Value': float})  # doctest: +SKIP
           Name  Value
    0   string1    1.0
    1   string2    2.0
    2  #Comment    3.0

    True, False, and NA values, and thousands separators have defaults,
    but can be explicitly specified, too. Supply the values you would like
    as strings or lists of strings!

    >>> pd.read_excel('tmp.xlsx', index_col=0,
    ...               na_values=['string1', 'string2'])  # doctest: +SKIP
           Name  Value
    0       NaN      1
    1       NaN      2
    2  #Comment      3

    Comment lines in the excel input file can be skipped using the
    ``comment`` kwarg.

    >>> pd.read_excel('tmp.xlsx', index_col=0, comment='#')  # doctest: +SKIP
          Name  Value
    0  string1    1.0
    1  string2    2.0
    2     None    NaN

In [103]:
pd.read_excel('Data/Excel2.xlsx', index_col =[0])

    b   c   d
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15